
## Plan Result (prod)




<pre><code>Plan: 4 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.ccpay-refunds-database-v15.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.ccpay-refunds-database-v15.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.ccpay-refunds-database-v15.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.ccpay-refunds-database-v15.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
* Update
  * azurerm_api_management_subscription.fee_pay_team_refund_subscription
  * azurerm_api_management_subscription.liberata_supplier_refund_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.fee_pay_team_refund_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "fee_pay_team_refund_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/e3732475-50a9-47a1-9ede-a61b709358d2"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.liberata_supplier_refund_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "liberata_supplier_refund_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/8091c6d1-245c-436c-9e92-de685ef53e5a"
        # (10 unchanged attributes hidden)
    }

  # module.ccpay-refunds-database-v15.azurerm_monitor_action_group.db-alerts-action-group[0] will be created
  + resource "azurerm_monitor_action_group" "db-alerts-action-group" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "db_monitor_ag-ccpay-refunds-api-postgres-db-v15-prod"
      + resource_group_name = "ccpay-refunds-api-postgres-db-v15-data-prod"
      + short_name          = "db_monitor_a"
      + tags                = {
          + "application"         = "fees-and-payments"
          + "builtFrom"           = "https://github.com/HMCTS/ccpay-refunds-app.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "production"
          + "managedBy"           = "Fees/Pay"
        }

      + email_receiver {
          + email_address           = (sensitive value)
          + name                    = "Email Receiver"
          + use_common_alert_schema = true
        }
    }

  # module.ccpay-refunds-database-v15.azurerm_monitor_metric_alert.db_alert_cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
      + auto_mitigate            = true
      + description              = "Whenever the cpu utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_cpu_percent_ccpay-refunds-api-postgres-db-v15-prod"
      + resource_group_name      = "ccpay-refunds-api-postgres-db-v15-data-prod"
      + scopes                   = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccpay-refunds-api-postgres-db-v15-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccpay-refunds-api-postgres-db-v15-prod",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "fees-and-payments"
          + "builtFrom"           = "https://github.com/HMCTS/ccpay-refunds-app.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "production"
          + "managedBy"           = "Fees/Pay"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.ccpay-refunds-database-v15.azurerm_monitor_metric_alert.db_alert_memory[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_memory" {
      + auto_mitigate            = true
      + description              = "Whenever the memory utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_memory_percent_ccpay-refunds-api-postgres-db-v15-prod"
      + resource_group_name      = "ccpay-refunds-api-postgres-db-v15-data-prod"
      + scopes                   = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccpay-refunds-api-postgres-db-v15-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccpay-refunds-api-postgres-db-v15-prod",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "fees-and-payments"
          + "builtFrom"           = "https://github.com/HMCTS/ccpay-refunds-app.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "production"
          + "managedBy"           = "Fees/Pay"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.ccpay-refunds-database-v15.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
      + auto_mitigate            = true
      + description              = "Whenever the storage utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_storage_utilization_ccpay-refunds-api-postgres-db-v15-prod"
      + resource_group_name      = "ccpay-refunds-api-postgres-db-v15-data-prod"
      + scopes                   = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccpay-refunds-api-postgres-db-v15-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccpay-refunds-api-postgres-db-v15-prod",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "fees-and-payments"
          + "builtFrom"           = "https://github.com/HMCTS/ccpay-refunds-app.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cc-payments"
          + "environment"         = "production"
          + "managedBy"           = "Fees/Pay"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

Plan: 4 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":757,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->